app/views/posts/index.html.erb

        <%= link_to time_ago_in_words(post.created_at) + " ago", post%> |
        <span class="likes_count"> <%= post.likes.count %> </span> Likes |
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 15]]

        <% end %>
        <% if post.comments.any? %>
---
SELECT  1 AS one FROM "comments"  WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 13]]
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 13]]