app/controllers/comments_controller.rb

  def new
    @post = Post.find(params[:post_id])
    @comment = Comment.new
    @user = User.find(current_user.id)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 13]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "comments" ("created_at", "name", "post_id", "thoughts", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-01-04 22:35:18.741242"], ["name", "mishal"], ["post_id", 1], ["thoughts", "fdnsjcdskmcdas"], ["updated_at", "2015-01-04 22:35:18.741242"], ["user_id", 2]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]