app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @post.likes.create
    render json: {new_like_count: @post.likes.count}
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 15]]
INSERT INTO "likes" ("created_at", "post_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-01-04 00:38:28.986471"], ["post_id", 15], ["updated_at", "2015-01-04 00:38:28.986471"]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 15]]