app/controllers/posts_controller.rb

  def find_id
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 10]]

  def create
    @post = Post.create(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-30 00:36:00.623409"], ["title", "BACON"], ["updated_at", "2014-12-30 00:36:00.623409"]]
UPDATE "posts" SET "updated_at" = $1, "user_id" = $2 WHERE "posts"."id" = 11  [["updated_at", "2015-01-03 14:45:37.057085"], ["user_id", 1]]

  def update
    find_id
    @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = 10  [["title", "wfewsdcfds"], ["updated_at", "2015-01-03 13:23:49.643830"]]

  def destroy
    find_id
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]