app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = Post.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = 2